app/controllers/comments_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
INSERT INTO "comments" ("name", "body", "post_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Alexthegurl"], ["body", "Maybe its because Trump is president!"], ["post_id", 1], ["created_at", 2017-04-19 03:55:33 UTC], ["updated_at", 2017-04-19 03:55:33 UTC]]
---
	def create
		@post = Post.find(params[:post_id])
		@comment = @post.comments.create(params[:comment].permit(:name, :body))