app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "Why do i cry at night?"], ["body", "Is it because i graduate in 3 weeks?"], ["created_at", 2017-04-19 03:45:12 UTC], ["updated_at", 2017-04-19 03:45:12 UTC]]
---
	def create
		@post = Post.new(post_params)

		if @post.save

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "posts" SET "title" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["title", "Why DO people marry Larry King?"], ["updated_at", 2017-04-19 03:58:18 UTC], ["id", 2]]
---
	def update
		@post = Post.find(params[:id])

		if @post.update(params[:post].permit(:title, :body))